artillery-load-test.yml
config:
  target: http://localhost:7000
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: Ramp up to peak load
    - duration: 120
      arrivalRate: 50
      name: Sustained peak load

scenarios:
  - flow:
    - think: 2
    - post:
        url: "/user/login"
        json:
          email: batman@gmail.com
          password: b123